<?php

use Random\RandomException;

$word1 = ['Чудесных', 'Суровых', 'Занятных', 'Внезапных'];
$word2 = ['слов', 'зим', 'глаз', 'дней', 'лет', 'мир', 'взор'];
$word3 = [
    'прикосновений',
    'поползновений',
    'судьбы явлений',
    'сухие листья',
    'морщины смерти',
    'долины края',
    'замены нету',
    'сухая юность',
    'навек исчезнув'
];
$word4 = [
    'обретаю',
    'понимаю',
    'начертаю',
    'закрываю',
    'оставляю',
    'вынимаю',
    'умираю',
    'замерзаю',
    'выделяю'
];
$word5 = [
    'очертания',
    'безысходность',
    'начертанья',
    'смысл жизни',
    'вирус смерти',
    'радость мира'
];
$str = '';

for ($i = 1; $i <= 2; $i++) {
    try {
        $str .= $word1[random_int(0, count($word1) - 1)] . ' ' .
            $word2[random_int(0, count($word2) - 1)] . ' ' .
            $word3[random_int(0, count($word2) - 1)] . ' ';
    } catch (RandomException $e) {
    }
    echo $str . PHP_EOL;
    $str = '';
}

try {
    echo 'Я ' . $word4[random_int(0, count($word2) - 1)] . ' ' . $word5[random_int(0, count($word2) - 1)];
} catch (RandomException $e) {
}
